{
    "posts": [
      { "id": 1, "title": "Adaptive Behavior Assessment System | Third Edition", "author": "Patti Harrison Thomas Oakland, PhD", "description":"Adaptive Behavior Assessment System Third Edition (ABAS-3) gives a complete picture of adaptive skills across the lifespan. It is particularly useful for evaluating those with developmental delays, autism spectrum disorder, intellectual disability, learning disabilities, neuropsychological disorders, and sensory or physical impairments.", "forms": "Behavior rating scale typically completed by parent, caregiver, and/or teacher", "scores/interpretation": "For the 11 skill areas assessed—norm-referenced scaled scores. For the 3 adaptive domains and the General Adaptive Composite (GAC)—norm-referenced standard scores, confidence intervals for standard scores, and percentile ranks. In addition, all scores can be categorized descriptively.", "age range": "Birth–89:11", "pub-date": "2015", "qual-level": "B", "completion time" : "15-20", "url": "https://via.placeholder.com/600/92c952" },
      { "id": 2, "title": "Adolescent/Adult Sensory Profile", "author": "Catana Brown, PhD, OTR, FAOTA Winnie Dunn, PhD, OTR, FAOTA", "description":"Adolescent/Adult Sensory Profile® helps measure sensory processing patterns and effects on functional performance. An individual answers questions regarding how he or she generally responds to sensations, as opposed to how he or she responds at any given time.", "forms": null, "scores/interpretation": null, "age range": "11 years and older", "pub-date": "2002", "qual-level": "B", "completion time" : "untimed", "url": "https://via.placeholder.com/600/771796"} ,
      { "id": 3, "title": "Autism Spectrum Rating Scales", "author": "Sam Goldstein, PhD Jack A. Naglieri, PhD", "description":"The Autism Spectrum Rating Scales (ASRS™) provides the first nationally standardized, norm-referenced ASD Rating Scale. This multi-informant measure helps identify symptoms, behaviors, and associated features of Autism Spectrum Disorders (ASDs) in children and adolescents.", "forms": null, "scores/interpretation": "ASRS Scoring Software or manual scoring", "age range": "2 - 18", "pub-date": "2015", "qual-level": "B", "completion time" : "Full form: 20 minutes, Short form: 5 minutes (15 items)", "url": "https://via.placeholder.com/600/24f355"},
      { "id": 4, "title": "Advanced Clinical Solutions for WAIS-IV and WMS-IV", "author": "ACS", "description":"Advanced Clinical Solutions for the WAIS®-IV and WMS®-IV enhances the clinical utility and expands the construct coverage of these respected tests. The new ACS tool provides a common and related sample linking WAIS®-IV, WSM®-IV, executive function, social cognition, and daily living.", "forms": null, "scores/interpretation": "Additional Index Scores, Error Scores, Effort Scores, Reliable Change, Pre-Morbid IQ, Social Perception, and Demographically Adjusted Norms", "age range": "Individuals 16:0 – 90.11 years", "pub-date": "2009", "qual-level": "C", "completion time" : "Varies depending on administration", "url": "https://via.placeholder.com/600/d32776"},
      { "id": 5, "title": "BASC-3 Behavioral and Emotional Screening System", "author": "Randy W. Kamphaus, PhD Cecil R. Reynolds, PhD", "description":"The BASC-3 Behavioral and Emotional Screening System (BASC-3 BESS) offers a reliable, quick, and systematic way to determine behavioral and emotional strengths and weaknesses of children and adolescents in preschool through high school.", "forms": "Behavior rating scale typically completed by parent, caregiver, and/or teacher", "scores/interpretation": "T scores, percentiles, for a general population", "age range": "3:0 - 18:11 (Teacher and Parent); 8:0 — 18:11 (Self-Report)", "pub-date": "2015", "qual-level": "B", "completion time" : "5-10 minutes", "url": "https://via.placeholder.com/600/f66b97"}
    ],
    "comments": [
      { "id": 1, "body": "some comment", "postId": 1 }
    ],
    "profile": { "name": "typicode" }
  }